{
  "name": "GetMailboxSetting",
  "contentType": "application/json; charset=utf-8",
  "description": "Get user mailbox settings. Get the user's mailboxSettings. You can view all mailbox settings, or get specific settings. Users can set the following settings for their mailboxes through an Outlook client: Users can set their preferred date and time formats using Outlook on the web. Users can choose one of the supported short date or short time formats. This GET operation returns the format the user has chosen. Users can set the time zone they prefer on any Outlook client, by choosing from the supported time zones that their administrator has set up for their mailbox server. The administrator can set up time zones in the Windows time zone format or  Internet Assigned Numbers Authority (IANA) time zone (also known as Olson time zone) format. The Windows format is the default. This GET operation returns the user's preferred time zone in the format that the administrator has set up. If you want that time zone to be in a specific format (Windows or IANA), you can first update the preferred time zone in that format as a mailbox setting. Subsequently you will be able to get the time zone in that format. Alternatively, you can manage the format conversion separately in your app.",
  "expectedStatusCodes": [
    200
  ],
  "longRunning": false,
  "httpMethod": "GET",
  "options": [
    {
      "Type": "Data",
      "odataFieldName": "Expand",
      "optional": true,
      "required": false,
      "field": "Expand",
      "optionsObjectDefinition": {
        "type": "Reference",
        "referenceName": "odata.Expand"
      }
    },
    {
      "Type": "Data",
      "odataFieldName": "Metadata",
      "optional": true,
      "required": false,
      "field": "Metadata",
      "optionsObjectDefinition": {
        "type": "Reference",
        "referenceName": "odata.Metadata"
      }
    },
    {
      "Type": "RetryFunc",
      "optional": true,
      "required": false,
      "field": "RetryFunc",
      "optionsObjectDefinition": {
        "type": "",
        "referenceName": null
      }
    },
    {
      "Type": "Data",
      "odataFieldName": "Select",
      "optional": true,
      "required": false,
      "field": "Select",
      "optionsObjectDefinition": {
        "type": "List",
        "referenceName": null,
        "nestedItem": {
          "type": "String",
          "referenceName": null
        }
      }
    }
  ],
  "resourceIdNameIsCommonType": true,
  "responseObject": {
    "type": "Reference",
    "nullable": false,
    "referenceName": "MailboxSettings",
    "referenceNameIsCommonType": true
  },
  "uriSuffix": "/me/mailboxSettings"
}