{
  "name": "DeviceManagementAbstractComplexSettingDefinition",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "description": "List of definition IDs for all possible implementations of this abstract complex setting",
      "jsonName": "implementations",
      "name": "Implementations",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "String",
          "nullable": false,
          "referenceName": null,
          "referenceNameIsCommonType": null
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    }
  ],
  "IsParent": false,
  "discriminatedParentModelName": "DeviceManagementSettingDefinition",
  "discriminatedTypeValue": "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
  "typeHintIn": "ODataType"
}