{
  "name": "DeviceManagementSettingDefinition",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Collection of constraints for the setting value",
      "jsonName": "constraints",
      "name": "Constraints",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "Reference",
          "nullable": false,
          "referenceName": "DeviceManagementConstraint",
          "referenceNameIsCommonType": true
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Collection of dependencies on other settings",
      "jsonName": "dependencies",
      "name": "Dependencies",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "Reference",
          "nullable": false,
          "referenceName": "DeviceManagementSettingDependency",
          "referenceNameIsCommonType": true
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The setting's description",
      "jsonName": "description",
      "name": "Description",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The setting's display name",
      "jsonName": "displayName",
      "name": "DisplayName",
      "objectDefinition": {
        "type": "String",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Url to setting documentation",
      "jsonName": "documentationUrl",
      "name": "DocumentationUrl",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "subtitle of the setting header for more details about the category/section",
      "jsonName": "headerSubtitle",
      "name": "HeaderSubtitle",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "title of the setting header represents a category/section of a setting/settings",
      "jsonName": "headerTitle",
      "name": "HeaderTitle",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "If the setting is top level, it can be configured without the need to be wrapped in a collection or complex setting",
      "jsonName": "isTopLevel",
      "name": "IsTopLevel",
      "objectDefinition": {
        "type": "Boolean",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Keywords associated with the setting",
      "jsonName": "keywords",
      "name": "Keywords",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "String",
          "nullable": false,
          "referenceName": null,
          "referenceNameIsCommonType": null
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Placeholder text as an example of valid input",
      "jsonName": "placeholderText",
      "name": "PlaceholderText",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "jsonName": "valueType",
      "name": "ValueType",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManangementIntentValueType",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    }
  ],
  "IsParent": true,
  "discriminatedParentModelName": "Entity",
  "discriminatedTypeValue": "#microsoft.graph.deviceManagementSettingDefinition",
  "typeHintIn": "ODataType"
}