{
  "name": "DeviceManagementConfigurationSimpleSettingDefinition",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Default setting value for this setting",
      "jsonName": "defaultValue",
      "name": "DefaultValue",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingValue",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "list of child settings that depend on this setting",
      "jsonName": "dependedOnBy",
      "name": "DependedOnBy",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "Reference",
          "nullable": false,
          "referenceName": "DeviceManagementConfigurationSettingDependedOnBy",
          "referenceNameIsCommonType": true
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "list of parent settings this setting is dependent on",
      "jsonName": "dependentOn",
      "name": "DependentOn",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "Reference",
          "nullable": false,
          "referenceName": "DeviceManagementConfigurationDependentOn",
          "referenceNameIsCommonType": true
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Definition of the value for this setting",
      "jsonName": "valueDefinition",
      "name": "ValueDefinition",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingValueDefinition",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    }
  ],
  "IsParent": true,
  "discriminatedParentModelName": "DeviceManagementConfigurationSettingDefinition",
  "discriminatedTypeValue": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
  "typeHintIn": "ODataType"
}