{
  "name": "DeviceManagementConfigurationSettingDefinition",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "jsonName": "accessTypes",
      "name": "AccessTypes",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingAccessTypes",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Details which device setting is applicable on",
      "jsonName": "applicability",
      "name": "Applicability",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingApplicability",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Base CSP Path",
      "jsonName": "baseUri",
      "name": "BaseUri",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Specifies the area group under which the setting is configured in a specified configuration service provider (CSP)",
      "jsonName": "categoryId",
      "name": "CategoryId",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Description of the item",
      "jsonName": "description",
      "name": "Description",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Display name of the item",
      "jsonName": "displayName",
      "name": "DisplayName",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Help text of the item",
      "jsonName": "helpText",
      "name": "HelpText",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "List of links more info for the setting can be found at",
      "jsonName": "infoUrls",
      "name": "InfoUrls",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "String",
          "nullable": false,
          "referenceName": null,
          "referenceNameIsCommonType": null
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Tokens which to search settings on",
      "jsonName": "keywords",
      "name": "Keywords",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "String",
          "nullable": false,
          "referenceName": null,
          "referenceNameIsCommonType": null
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Name of the item",
      "jsonName": "name",
      "name": "Name",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Indicates whether the setting is required or not",
      "jsonName": "occurrence",
      "name": "Occurrence",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingOccurrence",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Offset CSP Path from Base",
      "jsonName": "offsetUri",
      "name": "OffsetUri",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "List of referred setting information.",
      "jsonName": "referredSettingInformationList",
      "name": "ReferredSettingInformationList",
      "objectDefinition": {
        "type": "List",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null,
        "nestedItem": {
          "type": "Reference",
          "nullable": false,
          "referenceName": "DeviceManagementConfigurationReferredSettingInformation",
          "referenceNameIsCommonType": true
        }
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Root setting definition if the setting is a child setting.",
      "jsonName": "rootDefinitionId",
      "name": "RootDefinitionId",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Supported setting types",
      "jsonName": "settingUsage",
      "name": "SettingUsage",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingUsage",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Setting control type representation in the UX",
      "jsonName": "uxBehavior",
      "name": "UxBehavior",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationControlType",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Item Version",
      "jsonName": "version",
      "name": "Version",
      "objectDefinition": {
        "type": "String",
        "nullable": true,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "Supported setting types",
      "jsonName": "visibility",
      "name": "Visibility",
      "objectDefinition": {
        "type": "Reference",
        "nullable": false,
        "referenceName": "DeviceManagementConfigurationSettingVisibility",
        "referenceNameIsCommonType": true
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    }
  ],
  "IsParent": true,
  "discriminatedParentModelName": "Entity",
  "discriminatedTypeValue": "#microsoft.graph.deviceManagementConfigurationSettingDefinition",
  "typeHintIn": "ODataType"
}