{
  "name": "ClusterUpgradeDeltaHealthPolicy",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of applications health degradation allowed during cluster upgrades.\nThe delta is measured between the state of the applications at the beginning of upgrade and the state of the applications at the time of the health evaluation.\nThe check is performed after every upgrade domain upgrade completion to make sure the global state of the cluster is within tolerated limits. System services are not included in this.\nNOTE: This value will overwrite the value specified in properties.UpgradeDescription.HealthPolicy.MaxPercentUnhealthyApplications\n",
      "jsonName": "maxPercentDeltaUnhealthyApplications",
      "name": "MaxPercentDeltaUnhealthyApplications",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of nodes health degradation allowed during cluster upgrades.\nThe delta is measured between the state of the nodes at the beginning of upgrade and the state of the nodes at the time of the health evaluation.\nThe check is performed after every upgrade domain upgrade completion to make sure the global state of the cluster is within tolerated limits.\n",
      "jsonName": "maxPercentDeltaUnhealthyNodes",
      "name": "MaxPercentDeltaUnhealthyNodes",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": false,
      "readOnly": false,
      "required": true,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of upgrade domain nodes health degradation allowed during cluster upgrades.\nThe delta is measured between the state of the upgrade domain nodes at the beginning of upgrade and the state of the upgrade domain nodes at the time of the health evaluation.\nThe check is performed after every upgrade domain upgrade completion for all completed upgrade domains to make sure the state of the upgrade domains is within tolerated limits.\n",
      "jsonName": "maxPercentUpgradeDomainDeltaUnhealthyNodes",
      "name": "MaxPercentUpgradeDomainDeltaUnhealthyNodes",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": true,
      "readOnly": false,
      "required": false,
      "sensitive": false
    }
  ],
  "IsParent": false
}