{
  "name": "ServiceTypeHealthPolicy",
  "fields": [
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of unhealthy partitions per service.\n\nThe percentage represents the maximum tolerated percentage of partitions that can be unhealthy before the service is considered in error.\nIf the percentage is respected but there is at least one unhealthy partition, the health is evaluated as Warning.\nThe percentage is calculated by dividing the number of unhealthy partitions over the total number of partitions in the service.\nThe computation rounds up to tolerate one failure on small numbers of partitions.\n",
      "jsonName": "maxPercentUnhealthyPartitionsPerService",
      "name": "MaxPercentUnhealthyPartitionsPerService",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": false,
      "readOnly": false,
      "required": true,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of unhealthy replicas per partition.\n\nThe percentage represents the maximum tolerated percentage of replicas that can be unhealthy before the partition is considered in error.\nIf the percentage is respected but there is at least one unhealthy replica, the health is evaluated as Warning.\nThe percentage is calculated by dividing the number of unhealthy replicas over the total number of replicas in the partition.\nThe computation rounds up to tolerate one failure on small numbers of replicas.\n",
      "jsonName": "maxPercentUnhealthyReplicasPerPartition",
      "name": "MaxPercentUnhealthyReplicasPerPartition",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": false,
      "readOnly": false,
      "required": true,
      "sensitive": false
    },
    {
      "containsDiscriminatedTypeValue": false,
      "description": "The maximum allowed percentage of unhealthy services.\n\nThe percentage represents the maximum tolerated percentage of services that can be unhealthy before the application is considered in error.\nIf the percentage is respected but there is at least one unhealthy service, the health is evaluated as Warning.\nThis is calculated by dividing the number of unhealthy services of the specific service type over the total number of services of the specific service type.\nThe computation rounds up to tolerate one failure on small numbers of services.\n",
      "jsonName": "maxPercentUnhealthyServices",
      "name": "MaxPercentUnhealthyServices",
      "objectDefinition": {
        "type": "Integer",
        "nullable": false,
        "referenceName": null,
        "referenceNameIsCommonType": null
      },
      "optional": false,
      "readOnly": false,
      "required": true,
      "sensitive": false
    }
  ],
  "IsParent": false
}