{
  "name": "CreateEvent",
  "contentType": "application/json; charset=utf-8",
  "description": "Create event. Create an event in the user's default calendar or specified calendar. By default, the allowNewTimeProposals property is set to true when an event is created, which means invitees can propose a different date/time for the event. See Propose new meeting times for more information on how to propose a time, and how to receive and accept a new time proposal. You can specify the time zone for each of the start and end times of the event as part of their values, because the\nstart and end properties are of dateTimeTimeZone type. First find the supported time zones to make sure you set only time zones that have been configured for the user's mailbox server. When an event is sent, the server sends invitations to all the attendees. Setting the location in an event An Exchange administrator can set up a mailbox and an email address for a resource such as a meeting room, or equipment\nlike a projector. Users can then invite the resource as an attendee to a meeting. On behalf of the resource, the server accepts or rejects\nthe meeting request based on the free/busy schedule of the resource.\nIf the server accepts a meeting for the resource, it creates an event for the meeting in the resource's calendar. If the meeting is rescheduled,\nthe server automatically updates the event in the resource's calendar. Another advantage of setting up a mailbox for a resource is to control scheduling of the resource, for example, only executives\nor their delegates can book a private meeting room. If you're organizing an event that involves a meeting location: Additionally, if the meeting location has been set up as a resource, or if the event involves some equipment that has been set up as a resource",
  "expectedStatusCodes": [
    201
  ],
  "longRunning": false,
  "httpMethod": "POST",
  "options": [
    {
      "Type": "Data",
      "odataFieldName": "Metadata",
      "optional": true,
      "required": false,
      "field": "Metadata",
      "optionsObjectDefinition": {
        "type": "Reference",
        "referenceName": "odata.Metadata"
      }
    },
    {
      "Type": "RetryFunc",
      "optional": true,
      "required": false,
      "field": "RetryFunc",
      "optionsObjectDefinition": {
        "type": "",
        "referenceName": null
      }
    }
  ],
  "resourceIdNameIsCommonType": true,
  "requestObject": {
    "type": "Reference",
    "nullable": false,
    "referenceName": "Event",
    "referenceNameIsCommonType": true
  },
  "responseObject": {
    "type": "Reference",
    "nullable": false,
    "referenceName": "Event",
    "referenceNameIsCommonType": true
  },
  "uriSuffix": "/me/events"
}