{
 "name": "BlobInventoryPolicyDefinition",
 "fields": [
  {
   "containsDiscriminatedTypeValue": false,
   "jsonName": "filters",
   "name": "Filters",
   "objectDefinition": {
    "type": "Reference",
    "referenceName": "BlobInventoryPolicyFilter"
   },
   "optional": true,
   "required": false,
   "description": "An object that defines the filter set."
  },
  {
   "containsDiscriminatedTypeValue": false,
   "jsonName": "format",
   "name": "Format",
   "objectDefinition": {
    "type": "Reference",
    "referenceName": "Format"
   },
   "optional": false,
   "required": true,
   "description": "This is a required field, it specifies the format for the inventory files."
  },
  {
   "containsDiscriminatedTypeValue": false,
   "jsonName": "objectType",
   "name": "ObjectType",
   "objectDefinition": {
    "type": "Reference",
    "referenceName": "ObjectType"
   },
   "optional": false,
   "required": true,
   "description": "This is a required field. This field specifies the scope of the inventory created either at the blob or container level."
  },
  {
   "containsDiscriminatedTypeValue": false,
   "jsonName": "schedule",
   "name": "Schedule",
   "objectDefinition": {
    "type": "Reference",
    "referenceName": "Schedule"
   },
   "optional": false,
   "required": true,
   "description": "This is a required field. This field is used to schedule an inventory formation."
  },
  {
   "containsDiscriminatedTypeValue": false,
   "jsonName": "schemaFields",
   "name": "SchemaFields",
   "objectDefinition": {
    "type": "List",
    "referenceName": null,
    "nestedItem": {
     "type": "String",
     "referenceName": null
    }
   },
   "optional": false,
   "required": true,
   "description": "This is a required field. This field specifies the fields and properties of the object to be included in the inventory. The Schema field value 'Name' is always required. The valid values for this field for the 'Blob' definition.objectType include 'Name, Creation-Time, Last-Modified, Content-Length, Content-MD5, BlobType, AccessTier, AccessTierChangeTime, AccessTierInferred, Tags, Expiry-Time, hdi_isfolder, Owner, Group, Permissions, Acl, Snapshot, VersionId, IsCurrentVersion, Metadata, LastAccessTime, Tags, Etag, ContentType, ContentEncoding, ContentLanguage, ContentCRC64, CacheControl, ContentDisposition, LeaseStatus, LeaseState, LeaseDuration, ServerEncrypted, Deleted, DeletionId, DeletedTime, RemainingRetentionDays, ImmutabilityPolicyUntilDate, ImmutabilityPolicyMode, LegalHold, CopyId, CopyStatus, CopySource, CopyProgress, CopyCompletionTime, CopyStatusDescription, CustomerProvidedKeySha256, RehydratePriority, ArchiveStatus, XmsBlobSequenceNumber, EncryptionScope, IncrementalCopy, TagCount'. For Blob object type schema field value 'DeletedTime' is applicable only for Hns enabled accounts. The valid values for 'Container' definition.objectType include 'Name, Last-Modified, Metadata, LeaseStatus, LeaseState, LeaseDuration, PublicAccess, HasImmutabilityPolicy, HasLegalHold, Etag, DefaultEncryptionScope, DenyEncryptionScopeOverride, ImmutableStorageWithVersioningEnabled, Deleted, Version, DeletedTime, RemainingRetentionDays'. Schema field values 'Expiry-Time, hdi_isfolder, Owner, Group, Permissions, Acl, DeletionId' are valid only for Hns enabled accounts.Schema field values 'Tags, TagCount' are only valid for Non-Hns accounts."
  }
 ]
}